// 1. Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.

let result = 0.1 + 0.2;
console.log(`0.1 + 0.2 = ${+result.toFixed(2)}`);

// 2. Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.

let a = '1';
let b = 2;

let sum = +a + b;
console.log(`sum = ${sum}`);

sum = Number(a) + b;
console.log(`sum = ${sum}`); 

// 3. Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.

const inputSize = +prompt('Введіть обсяг флешки в Гб', '');

if (inputSize && inputSize > 0) {
    let k = Math.trunc(inputSize * 1024 / 820);
    alert(`На Вашу флешку вміститься ${k} файлів/файла по 820Мб`);
} else {
    alert('Невірно введені данні');
}